Tekla Open API Reference for Tekla Structures 2025
TeklaDrawingColor Constructor (Color)
 Construct a TeklaDrawingColor instance by passing in an RGB System.Drawing.Color value. This is the safe non-throwing constructor to use.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TeklaDrawingColor(
	Color RGB
)
Public Sub New (
	RGB As Color
)
Parameters
RGB
Type: System.Drawing.Color
The color to use for instantiating, as a System.Drawing.Color
See Also
Reference
TeklaDrawingColor Structure
TeklaDrawingColor Overload
Tekla.Structures.Drawing Namespace